include <stdio.h> // โปรแกรมที่ 5.2 แสดงการใช้ฟังก์ชัน printf() บังคับการพิมพ์ค่าแบบคุมความกว้างผลลัพธ์
main() {	
    int score = 10; 	
    float mean = 3.75;	
    printf("%-10d\n", score);	// พิมพ์จำนวนเต็ม 10 ตำแหน่ง 
    	   // (เกิดช่องว่างด้านขวา)
    printf("%10d\n", score);	// พิมพ์จำนวนเต็ม 10 ตำแหน่ง 
	   // (เกิดช่องว่างด้านซ้าย)
    printf("%-10.2f\n", mean);	// พิมพ์จำนวนจริง 10 ตำแหน่ง รวมจุดทศนิยม
	   // ทศนิยม 2 ตำแหน่ง (เกิดช่องว่างด้านขวา)
    printf("%10.2f\n", mean);    	// พิมพ์จำนวนจริง 10 ตำแหน่ง รวมจุดทศนิยม
	   // ทศนิยม 2 ตำแหน่ง (เกิดช่องว่างด้านซ้าย)
}	