#include <stdio.h> // โปรแกรมที่ 7.4 แสดงวิธีการใช้งานอาเรย์ 3 มิติ
main() {
    int x[4][3][2] = {  {{1, 2}, {3, 4}, {5, 6}}, 
                            {{7, 8}, {9, 10}, {11, 12}}, 
                            {{13, 14}, {15, 16}, {17, 18}}, 
                            {{19, 20}, {21, 22}, {23, 24}}
                        };
    for(int i = 0; i < 4; i++){
        for(int j = 0; j < 3; j++){
            for(int k = 0; k < 2; k++){
                printf("x[%d][%d][%d] = %d\n", i, j, k, x[i][j][k]);
            }
        }
    }
}